Description: Downloads the latest version of Tart from Github; pulls apart the package and checks the binary's code 
  signature.
Identifier: com.github.wegotoeleven-recipes.pkg.Tart
MinimumVersion: '2.3'
ParentRecipe: com.github.wegotoeleven-recipes.download.Tart

Input:
  NAME: Tart
  GITHUB_REPO: cirruslabs/tart
  INCLUDE_PRERELEASES: "false"

Process:

  - Processor: Unarchiver
    Arguments:
      archive_path: '%pathname%'
      destination_path: "%RECIPE_CACHE_DIR%/unpack/"

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs: {}
      pkgroot: "%RECIPE_CACHE_DIR%/scripts"

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Library: "0755"
        Library/Application Support: "0755"
        Library/Application Support/Tart: "0755"
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"

  - Processor: Copier
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/pkgroot/Library/Application Support/Tart/"
      overwrite: true
      source_path: "%RECIPE_CACHE_DIR%/unpack/"

  - Processor: FileCreator
    Arguments:
      file_path: "%RECIPE_CACHE_DIR%/scripts/postinstall"
      file_mode: "0755"
      file_content: |
        #!/bin/bash

        set -e

        # Remove existing symlink/executable
        rm -rf /usr/local/bin/tart

        # Create new executable
        echo "#!/bin/sh" > /usr/local/bin/tart
        echo "exec '/Library/Application Support/Tart/tart.app/Contents/MacOS/tart' \"\$@\"" >> /usr/local/bin/tart

        # Set permissions
        chmod +x /usr/local/bin/tart

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        pkgname: "%NAME%-%version%"
        pkgdir: "%RECIPE_CACHE_DIR%"
        id: com.github.cirruslabs.tart-app
        options: purge_ds_store
        scripts: scripts
        version: "%version%"
        chown:
          - path: Library
            user: root
            group: wheel