Description: Unzip the latest version of the Logi Options+ installer app
Identifier: com.github.wegotoeleven-recipes.download.LogiOptionsPlus
MinimumVersion: '2.3'

Input:
  NAME: Logi OptionsPlus
  URL: https://download01.logi.com/web/ftp/pub/techsupport/optionsplus/logioptionsplus_installer.zip

Process:
  - Processor: DeprecationWarning
    Arguments:
      warning_message: Consider switching to the logioptionsplus_installer recipes in the TekTekkers-recipes repo. This recipe is deprecated and will be removed in the future.

  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%.zip"
      url: "%URL%"

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unzip"
      purge_destination: true

  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/unzip/*.app"

  - Processor: CodeSignatureVerifier
    Arguments: 
      input_path: "%found_filename%"
      requirement: identifier "com.logi.optionsplus.installer" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = QED4VVPZWA

  - Processor: PlistReader
    Arguments:
      info_path: "%found_filename%/Contents/Info.plist"
      plist_keys:
          CFBundleVersion: version
          CFBundleIdentifier: BUNDLE_ID
