Description: Downloads the latest versions of the Circonus Unified Agent from Github and combines into an installer pkg
Comment: This recipe does not use code signature verification as the product isn't signed :(
Identifier: com.github.wegotoeleven-recipes.pkg.CirconusUnifiedAgent
MinimumVersion: '2.3'
ParentRecipe: com.github.wegotoeleven-recipes.download.CirconusUnifiedAgent

Input:
  NAME: Circonus Unified Agent
  INCLUDE_PRERELEASES: ""
  GITHUB_REPO: circonus-labs/circonus-unified-agent
  UNIVERSAL_VAR: all
  API_KEY: ""

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        scripts: "0755"
        root/private: "0755"
        root/private/tmp: "0777"
        root/private/tmp/cua_install: "0755"
      pkgroot: "%RECIPE_CACHE_DIR%/pkgroot"

  - Processor: Copier
    Arguments:
      source_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/pkgroot/root/private/tmp/cua_install/"

  - Processor: FileCreator
    Arguments:
      file_path: "%RECIPE_CACHE_DIR%/pkgroot/scripts/preinstall"
      file_mode: "0755"
      file_content: |
        #!/bin/zsh

        # Determine whether Circonus is already installed
        if [[ -e "/Library/LaunchDaemons/com.circonus.circonus-unified-agent.plist" ]]; then
            echo "Circonus LaunchDaemon is installed. Unloading and removing..."
            /bin/launchctl unload "/Library/LaunchDaemons/com.circonus.circonus-unified-agent.plist"
            /bin/rm -rf "/Library/LaunchDaemons/com.circonus.circonus-unified-agent.plist"
        else
            echo "Circonus LaunchDaemon not installed."
        fi

        # Check and report installed version
        if [[ -e "/opt/circonus/unified-agent/sbin/circonus-unified-agentd" ]]; then
            INSTALLED_VERSION=$(/opt/circonus/unified-agent/sbin/circonus-unified-agentd --version 2>/dev/null | /usr/bin/awk -F' ' '/circonus-unified-agent/ { print $2 }')
            echo "Circonus Unified Agent version ${INSTALLED_VERSION} installed."
        else
            echo "Circonus Unified Agent binary not installed."
        fi
  - Processor: FileCreator
    Arguments:
      file_path: "%RECIPE_CACHE_DIR%/pkgroot/scripts/postinstall"
      file_mode: "0755"
      file_content: |
        #!/bin/zsh

        # Check for API key
        API_KEY="%API_KEY%"
        if [[ -z "${API_KEY}" ]]; then
            echo "API Key not supplied. Unable to install. Bailing..."
            exit 1
        fi

        # Create install directory if missing
        if [[ ! -e "/opt/circonus/unified-agent" ]]; then
            echo "Circonus Unified Agent install directory not present. Creating..."
            /bin/mkdir -p "/opt/circonus/unified-agent"
        else
            echo "Circonus Unified Agent install directory present."
        fi

        # Install universal tarball
        echo "Installing..."
        /usr/bin/tar fUxz "/private/tmp/cua_install/cua_install.tar.gz" --directory /opt/circonus/unified-agent

        # Create checks directory if missing
        if [[ ! -e "/opt/circonus/unified-agent/etc/checks.d" ]]; then
            echo "Circonus Unified Agent checks directory not present. Creating..."
            /bin/mkdir -p "/opt/circonus/unified-agent/etc/checks.d"
        else
            echo "Circonus Unified Agent checks directory present."
        fi

        # Set permissions
        echo "Setting permissions..."
        /usr/sbin/chown -R root:wheel /opt/circonus/unified-agent

        # Cleanup
        echo "Cleaning up installation files..."
        /bin/rm -rf "/private/tmp/cua"

        # Check and report installed version
        INSTALLED_VERSION=$(/opt/circonus/unified-agent/sbin/circonus-unified-agentd --version 2>/dev/null | /usr/bin/awk -F' ' '/circonus-unified-agent/ { print $2 }')
        if [[ -n "${INSTALLED_VERSION}" ]]; then
            echo "Circonus Unified Agent version ${INSTALLED_VERSION} installed."
        else
            echo "Unable to determine Circonus Unified Agent version. Something has gone wrong during the installation process! Please try again."
            exit 1
        fi

        # Setup config file
        if [[ ! -e "/opt/circonus/unified-agent/etc/circonus-unified-agent.conf" ]]; then
            echo "Config file not present. Setting up config file..."
            /bin/cp "/opt/circonus/unified-agent/etc/example-circonus-unified-agent.conf" "/opt/circonus/unified-agent/etc/circonus-unified-agent.conf"
        else
            echo "Config file already deployed."
        fi

        # Update API key in config file
        echo "Updating API key..."
        /usr/bin/sed -i -e "s/  api_token = \".*\"/  api_token = \"${API_KEY}\"/" "/opt/circonus/unified-agent/etc/circonus-unified-agent.conf"

        # Setup LaunchDaemon
        echo "Setting up Circonus Unified Agent LaunchDaemon..."
        /bin/cp "/opt/circonus/unified-agent/service/circonus-unified-agent.macos" "/Library/LaunchDaemons/com.circonus.circonus-unified-agent.plist"
        /bin/launchctl load "/Library/LaunchDaemons/com.circonus.circonus-unified-agent.plist"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        id: com.circonus.circonus-unified-agent
        options: purge_ds_store
        pkgname: "%NAME%-%version%"
        pkgroot: "%pkgroot%/root"
        scripts: "%pkgroot%/scripts"
        version: "%version%"

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/downloads"
        - "%RECIPE_CACHE_DIR%/pkgroot"