Description: Downloads the latest versions of the Circonus Unified Agent from Github
Identifier: com.github.wegotoeleven-recipes.download.CirconusUnifiedAgent
MinimumVersion: '2.3'

Input:
  NAME: Circonus Unified Agent
  INCLUDE_PRERELEASES: ""
  GITHUB_REPO: circonus-labs/circonus-unified-agent

Process:
  - Processor: GitHubReleasesInfoProvider
    Arguments:
      asset_regex: circonus-unified-agent_\d+.\d+.\d+_darwin_all.tar.gz
      github_repo: "%GITHUB_REPO%"
      include_prereleases: "%INCLUDE_PRERELEASES%"
      sort_by_highest_tag_names: "true"

  - Processor: URLDownloader
    Arguments:
      filename: "cua_install.tar.gz"

  - Processor: EndOfCheckPhase

  - Processor: Unarchiver
    Arguments:
      archive_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/unpack/"

  - Processor: FileFinder
    Arguments:
      pattern: "%RECIPE_CACHE_DIR%/unpack/*/circonus-unified-agentd"

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%found_filename%"
      requirement: identifier "circonus-unified-agentd" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = SG4A8XDNN2

  - Processor: PathDeleter
    Arguments:
      path_list:
        - "%RECIPE_CACHE_DIR%/unpack"