Description: Recipe description
Identifier: com.github.wegotoeleven-recipes.pkg.YubicoAuthenticator
ParentRecipe: com.github.n8felton.yubico-authenticator.download
MinimumVersion: '2.3'

Input:
  NAME: Yubico Authenticator
  GITHUB_REPO: Yubico/yubioath-flutter
  INCLUDE_PRERELEASES: "false"

Process:

  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: "%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%.dmg"

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/root"

  - Processor: Copier
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/root/Applications/%NAME%.app"
      source_path: "%RECIPE_CACHE_DIR%/downloads/%NAME%-%version%.dmg/%NAME%.app"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: "%bundleid%"
        options: purge_ds_store
        pkgname: "%NAME%-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/root"
        version: "%version%"