Description: Recipe description
Identifier: com.github.wegotoeleven-recipes.pkg.VirtualBuddy
ParentRecipe: com.github.wegotoeleven-recipes.download.VirtualBuddy
MinimumVersion: '2.3'

Input:
  NAME: VirtualBuddy
  GITHUB_REPO: insidegui/VirtualBuddy
  INCLUDE_PRERELEASES: "false"

Process:

  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: "%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg"

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/root"

  - Processor: Copier
    Arguments:
      destination_path: "%RECIPE_CACHE_DIR%/root/Applications/%app_name%"
      source_path: "%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/%app_name%"

  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: "%bundleid%"
        options: purge_ds_store
        pkgname: "%NAME%-%version%"
        pkgroot: "%RECIPE_CACHE_DIR%/root"
        version: "%version%"